#!/usr/bin/env python3
'''python 编程语言

语言的发明和发展
    - 荷兰的Guido van Rossum创作
    - 名称源自 Monty Python，是1969年成立的英国喜剧团
    - 目前由Python 社区维护
    - 1991年发布 Python 0.9.0
    - 2000年发布 Python 2.0，目前已经终止维护
    - 2008年发布 Python 3.0
    - 2022年11月稳定版为 Python 3.11
特点
    - 开源
    - 跨平台
    - 高效
    - 简单易学
    - 功能丰富
    - 应用广泛
    - 丰富的函数库
    - Python理念
用途
    - 小工具
    - 文本处理
    - 文件处理
    - 辅助软件开发
    - 从小型到大型
    - 从初级到专业
    - 从业余到职业

专业特点
    - 容易阅读
    - 支持面向对象、结构化编程
    - 动态名称绑定、引用计数、自动内存回收
    - 支持函数式编程等多种语言的特征
    - 很容易使用C语言进行扩充
    - 很多解释器
    - 支持交叉编译

专业用途
    - 很多系统的标准组件
    - 很多软件的内嵌语言
    - Web服务器框架
    - 图形、图像、多媒体文件处理
    - 系统调用
    - 图形界面
    - 网络工具开发
    - 2D、3D软件开发
    - 科学计算
    - 人工智能
    - 总结：资源无数，应用无限

'''
if __name__ == '__main__':
    print(__doc__)
